app/controllers/admin_controller.rb

SELECT  "users".* FROM "users" ORDER BY name ASC LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users"
SELECT "cars".* FROM "cars" INNER JOIN "users" ON "users"."id" = "cars"."user_id"
---
  def home
    #@users = User.paginate(page: params[:page], per_page: 10)
    #@users = User.where(:career => 'Medicina').paginate(:page => params[:page]).order('name ASC')
    @users = User.paginate(:page => params[:page], per_page: 10).order('name ASC')
    @countUser = User.count
    @countCarsUser = Car.joins(:user).uniq

SELECT COUNT(*) AS count_all, DATE(created_at) AS date_created_at FROM "users" GROUP BY DATE(created_at)
SELECT COUNT(*) AS count_all, DATE(created_at) AS date_created_at FROM "routes" GROUP BY DATE(created_at)
SELECT COUNT(*) AS count_all, "cars"."modelo" AS cars_modelo FROM "cars" GROUP BY "cars"."modelo"
---
  def statistics
    @users = User
    @countUser = User.count
    #@routesCreatedPerDay = Route.group("DATE(created_at)").count
    @routesCreatedPerDay = Route.group(:created_at).count
    @usersCreatedPerDay = User.group("DATE(created_at)").count
    @carsPerModel = Car.group("modelo").count