app/controllers/cars_controller.rb

  def index
    @cars = Car.where(:user_id => current_user.id).all
    @countCars = Car.where(:user_id => current_user.id).count
---
SELECT "cars".* FROM "cars" WHERE "cars"."user_id" = ?  [["user_id", 174]]
SELECT COUNT(*) FROM "cars" WHERE "cars"."user_id" = ?  [["user_id", 174]]