app/controllers/home_controller.rb

  def editar_perfil
    @app = "RunApp"
    @image = User.where(:id => current_user.id).uniq
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 174], ["LIMIT", 1]]