app/controllers/routes_controller.rb

  def new
    @myCars = Car.where(:user_id => current_user.id)
---
SELECT "cars".* FROM "cars" WHERE "cars"."user_id" = ?  [["user_id", 176]]