app/controllers/routes_controller.rb

  def index
    #@routes = Route.othersRoutes(current_user.id).paginate(:page => params[:page], per_page: 10).order('created_at DESC')
    @routes = Route.filterSearchOtherRoutes(params[:sKeyWord], params[:sCost],params[:sDate],params[:sCapacity],params[:sType],params[:sBrand], current_user.id).paginate(:page => params[:page], per_page: 10).order('created_at DESC')
---
SELECT  "routes".* FROM "routes" WHERE (id_user != 174) ORDER BY created_at DESC LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "routes" WHERE (id_user != 174)

  def show_my_routes
    @routes = Route.filterSearchMyRoutes(params[:sKeyWord], params[:sCost],params[:sDate],params[:sCapacity],params[:sType],params[:sBrand], current_user.id).paginate(:page => params[:page], per_page: 10).order('created_at DESC')
---
SELECT  "routes".* FROM "routes" WHERE (id_user = 174) ORDER BY created_at DESC LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "routes" WHERE (id_user = 174)

  def show
    @extraInfoRouteConductor =  Route.extraInfoRouteConductor(@route.id_user)
    @extraInfoRoute = Route.extraInfoRoute(@route.car_placa)
    @usersInRoute = Route.usersInRoute(@route.id)
    @myRating = Route.getMyRating(@route.id, current_user.id)
    @countUsersRating = Route.countUsersRating(@route.id)
---
SELECT "cars".* FROM "cars" INNER JOIN "users" ON "users"."id" = "cars"."user_id" WHERE "cars"."placa" = ?  [["placa", "AAA-11A"]]

  def updateComments
    if( Route.isNotCommentNil((params[:route][:last_comment]).to_s) )
      Route.updateComments(params[:routeId], current_user.id, params[:route][:last_comment])
---
UPDATE "routes" SET "comments" = ?, "updated_at" = ? WHERE "routes"."id" = ?  [["comments", "//A1B2C3//crcruedaal//A1B2C3//hola, creo que deberías bajarle al precio un poco.//A1B2C3//06/11/2017//commentA1B2C3//"], ["updated_at", "2017-11-06 00:52:00.273541"], ["id", 13]]

  def create
    @route = Route.new(route_params)

    respond_to do |format|
      if @route.save
---
INSERT INTO "routes" ("title", "description", "from_lat", "from_lng", "to_lat", "to_lng", "waypoints", "departure", "cost", "created_at", "updated_at", "id_user", "car_placa", "spaces_available", "users_in_route", "ratings", "userRating", "comments") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @route.update(route_params)
---
UPDATE "routes" SET "comments" = ?, "updated_at" = ? WHERE "routes"."id" = ?  [["comments", "hola"], ["updated_at", "2017-11-05 05:20:40.899923"], ["id", 13]]

    def set_route
      @route = Route.find(params[:id])
---
SELECT  "routes".* FROM "routes" WHERE "routes"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]