app/views/routes/index.html.erb

            <p><b>Descripción:</b> <%= route.description %></p>
            <p><b>Creador:</b> <%= User.find(route.id_user).nick %></p>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 174], ["LIMIT", 1]]