app/views/routes/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 176], ["LIMIT", 1]]
---
              <span class="input-group-addon glyphicon glyphicon-user" style="background-color: lightgreen"></span>
              <textarea rows="1" class="form-control" id='usernameRegister' type='text' readonly='true' style="margin: 0%; border: none; width: 100%; text-align: center; resize: none;" ><%= User.find(@route.id_user).nick %></textarea>